<!-- code_chunk_output -->

# [权限管理系统说明](#权限管理系统说明)

- [1. 概述](#1-概述)
  - [1.1 结构图](#11-结构图)
  - [1.2 名词解释](#12-名词解释)
- [2. 常见问题](#2-常见问题)
  - [2.1 新的集团用户，如何对运维人员、业主、社会单位做分区管理](#Q1)
  - [2.2 如何为公司员工添加运维人员（用户类型）账号？](#Q2)
  - [2.3 当员工离职，或者人员调动时，如何删除运维人员（用户类型）账号？](#Q3)
  - [2.4 如果原来没有对社会单位做分组，现在根路径下社会单位过多，如何对已有的社会单位和业主做分区域管理？](#Q4)
  - [2.5 营销人员在外面需要给客户演示系统功能, 包括 APP 和 web 的功能, 如何创建一个供销售人员使用的演示账号？](#Q5)
  - [2.6 当业主或者运维人员忘记密码时，如何重置运维人员或者业主的密码？](#Q6)
  - [2.7 当公司人员创建了业主之后(即直接在 APP 中注册账号，此时注册的是一个业主类型的账号)，如何把该业主转为运维人员？](#Q7)
  - [2.8 当需要确认一个用户（业主或运维人员）能查看哪些社会单位时，怎么查询该用户的可见社会单位？](#Q8)
  - [2.9 当业主需要查看指定社会单位时，如何给该业主增加查看某个社会单位的权限？](#Q9)
  - [2.10 当运维人员需要查看指定社会单位时，如何给该运维人员增加查看某个社会单位的权限？](#Q10)

<!-- /code_chunk_output -->

<!-- # 权限管理系统说明 -->

> 本权限管理说明文档适用于管理员。

## 1. 概述

<!-- ![view-user-list](./new/view-user-list.png) 图 1 权限管理主页图 -->

@import "new/view-user-list.png" { title="权限管理主页图" alt="权限管理主页图"}
如上图所示，权限管理主界面，左侧是用户组树，右侧则包含运维人员，业主，社会单位等子页面，每个页面包含搜索框，列表，页脚等。
而当选中用户组，再点击业主、运维人员、社会单位等字标签时，右侧显示该用户组下的对应的列表。

操作如下：
@import "new/selectTabExample.gif"

### 1.1 结构图

![authMngStructure](./new/authMngStructure.png)
如上图所示，用户组下包含：用户、子用户组、社会单位，其中用户组与子用户组是父子关系（如广东省运维组和深圳市运维组），子用户组可以包含子子用户组（如深圳市和南山区），进而形成一棵树形结构，而用户可分为: 业主、运维人员两种类型，可根据其所属的角色决定其拥有哪些云系统的权限，角色分为终端用户、运维人员、管理员、体验用户、集团体验用户，具体权限请看名词解释。

### 1.2 名词解释

- 用户组：由用户、子用户组、社会单位构成，用于分组管理用户和社会单位；

- 用户：用户分为运维人员和业主两种类型。用户拥有权限和资源，用户的角色决定其拥有哪些权限，用户所在的用户组决定了其可以管理哪些资源（社会单位和用户）

  - 运维人员（用户类型）：此用户类型用于创建系统的运维人员账户。只有当前用户组的运维人员以及上级用户组的运维人员才拥有查看当前用户组以及子用户组的资源的权限；

  - 业主（用户类型）：此用户类型用于创建业主账户。业主只能查看其自身创建的社会单位，或者运维人员给他分配的社会单位；

- 角色：角色是权限的集合，不同的角色有不同的权限；

  - 终端用户：此角色具有查看社会单位数据、添加社会单位、修改社会单位等权限，适用于业主；

  - 运维人员：此角色具有查看社会单位数据、添加社会单位、修改社会单位、添加业主、新建工单、处理工单、查看地图界面等权限，适用于现场安装人员、运维人员；

  - 管理员：此角色具有查看社会单位、添加社会单位、修改社会单位、添加用户(添加业主或添加运维人员)、查看地图界面、做用户权限管理、删除社会单位等权限，适用于监控中心的管理员；

  - 体验用户：此角色具有查看社会单位详情页面，适用于有意向的业主；

  - 集团体验用户：此角色具有查看社会单位详情，查看地图页面等权限，适用于：1）有意向的业主；2）需要给客户展示系统的销售人员；

## 2. 常见问题

1. <span id="Q1">Q: 新的集团用户，如何对运维人员、业主、社会单位做分区管理？</span>
   A: ![](./new/createAndManageNewArea.gif) - 在左侧用户组树创建好各用户组；

   - 创建好各用户组下的运维人员（[见 Q11](#Q11)），后续运维人员创建的社会单位和业主，都属于其所在的用户组，各用户组下的社会单位对其他组的运维人员不可见，只对当前用户组或者上级用户组的运维人员可见。 - 创建好业主，后续该业主所创建的社会单位只对该用户以及上级用户组的运维人员可见。
     <br/>

1. <span id="Q2">Q: 如何为公司员工添加运维人员（用户类型）账号？</span>
   A: ![](./new/createOpsMember.gif) - 在权限管理主页面中点击‘运维人员’标签， - 再点击用户组树右侧表格右上方的‘+’号按钮，弹出‘添加运维人员’对话框; - 在对话框内填写电话、登录名、昵称、角色、用户组等信息之后，点击确定，即可添加新的运维人员账号，注意此时所添加的运维人员账号的密码为手机号码后六位。
   <br/>

1. <span id="Q3">Q: 当员工离职，或者人员调动时，如何删除运维人员（用户类型）账号？</span>
   A: ![](./new/deleteOpsMember.gif) - 点击‘运维人员’标签； - 如果知道该运维人员所在用户组名称，则在左侧用户组树中点击该用户组；如果不知道该运维人员所在用户组名称时，则点击根用户组； - 在右侧的搜索框中输入该运维人员的名称或者电话按回车键，则下方会显示搜索到的运维人员列表; - 点击对应运维人员所在行的操作一栏，点击‘删除’按钮，可以删除该运维人员。
   <br/>

1. <span id="Q4">Q: 如果原来没有对社会单位做分组，现在根路径下社会单位过多，如何对已有的社会单位和业主做分区域管理？</span>
   A: ![manageStation](./new/manageStation.gif) - 创建好用户组，可以按照区域划分（比如深圳市、河源市、佛山市），也可以按照社会单位类型划分（扶贫社会单位、工商业社会单位、地面社会单位）； - 点击社会单位或者业主标签页，逐个修改社会单位业主的用户组属性，将他调整到对应的子用户组，则该业主的所有社会单位也会调整到对应的子用户组。
   <br/>

1. <span id="Q5">Q: 营销人员在外面需要给客户演示系统功能, 包括 APP 和 web 的功能, 如何创建一个供销售人员使用的演示账号？</span>
   A: ![manageMarketingMember](./new/manageMarketingMember.gif) - 创建给营销人员专用的用户组 - 从已有的社会单位中挑选几个典型社会单位，添加到新创建的用户组 - 在该组下创建运维人员，分配体验用户或集团体验用户或管理员角色（[见 Q2](#Q2)）
   注意：演示时最好能够演示一些典型社会单位的数据，这样更有说服力，但是演示的时候不能够误改或者误删数据

1. <span id="Q6">Q: 当业主或者运维人员忘记密码时，如何重置运维人员或者业主的密码？</span>
   A: ![](./new/resetPassword.gif) - 首先确定该用户是运维人员，还是业主； - 点击对应的标签(业主或运维人员)； - 点击左侧用户组树根节点; - 在搜索框输入该业主或运维人员的手机号或者名称，按回车键进行搜索，下方会显示对应的用户列表。 - 点击该用户所在行的‘操作’一栏的‘编辑’按钮，进入用户属性页面； - 点击用户属性表单头的‘重置密码’按钮，即可重置密码,重置的新密码为手机后 6 位。
   <br/>

1. <span id="Q7">Q: 当公司人员创建了业主之后(即直接在 APP 中注册账号，此时注册的是一个业主类型的账号)，如何把该业主转为运维人员？</span>
   A: ![](./new/transferEndUserToOpsMember.gif) - 点击左侧根用户组； - 点击‘业主’标签； - 在搜索框内输入该业主的名称或手机号，按回车键，下方会显示搜索到的业主列表； - 点击该业主所在行的‘操作’一栏的‘用户转换’图标，即可转换该业主为运维人员。 - 输入密码，点击确认，即可转换‘业主’为‘运维人员’
   <br/>

1. <span id="Q8">Q: 当需要确认一个用户（业主或运维人员）能查看哪些社会单位时，怎么查询该用户的可见社会单位？</span>
   A: ![viewabelStation](./new/viewabelStation.gif) - 进入用户属性页面（[见 Q11](#Q11)) - 用户属性页面下方的社会单位列表即使该用户的可见社会单位。
   <br/>

1. <span id="Q9">Q: 当业主需要查看指定社会单位时，如何给该业主增加查看某个社会单位的权限？</span>
   A: ![](./new/configViewableStationForEndUser.gif) - 进入业主属性页面（[见 Q11](#Q11)）； - 点击业主属性页面社会单位列表右上方的‘+’号按钮，可弹出‘添加当前用户可见电话’的弹窗。 - 弹窗内包含左侧用户组树，上方有搜索框（可输入社会单位名称或地址进行搜索，搜索结果显示在下方的社会单位列表中），右侧为对应用户组下的社会单位列表。 - 点击社会单位列表项(单选)，再点击确定,即可为业主添加该查看该社会单位的权限。
   <br/>

1. <span id="Q10">Q: 当运维人员需要查看指定社会单位时，如何给该运维人员增加查看某个社会单位的权限？</span>
   A: ![](./new/configViewableStationForOpsMember.gif) - 进入运维人员属性页面（[见 Q11](#Q11)）； - 点击运维人员属性页面社会单位列表右上方的‘+’号按钮，可弹出‘添加当前用户可见电话’的弹窗。 - 弹窗内包含左侧用户组树，上方有搜索框（可输入社会单位名称或地址进行搜索，搜索结果显示在下方的社会单位列表中），右侧为对应用户组下的社会单位列表。 - 点击社会单位列表项(单选)，再点击确定,即可为业主添加该查看该社会单位的权限（注意：此时该运维人员所在用户组的其他运维人员也能查看该社会单位）。
   <br/>

1. <span id="Q11">Q: 如何进入用户的属性页面？</span>
   A: ![](./new/enterEndUserPropertyPage.gif) - 当所查看的用户是业主时，点击左侧根用户组节点，点击‘业主’标签，并在搜索框输入业主的名称或电话，点击搜索或者按回车键，搜索框的下方会显示搜索结果，点击指定社会单位的‘操作’一栏的‘编辑’按钮，进入该业主的属性页面； - 当所查看的用户是运维人员时，点击左侧根用户组节点，点击‘运维人员’标签，并在搜索框输入运维人员的名称或电话，点击搜索或者按回车键，搜索框的下方会显示搜索结果，点击指定社会单位的‘操作’一栏的‘编辑’按钮，进入该运维人员的属性页面； - 当所查看的用户是社会单位拥有者，点击左侧根用户组节点，点击‘社会单位标签’，并在搜索框输入社会单位名称或地址，低价搜索或按回车键，搜索框下方会显示搜索结果，点击指定社会单位的‘所有者’一栏的所有者名称，进入该社会单位所有者的属性页面。
   <br/>

1. <span id="Q12">Q: 如何为指定用户组添加指定社会单位？</span>
   A: ![](./new/addSpecificStationForUserGroup.gif) - 在左侧点击指定用户组； - 点击‘社会单位’标签； - 点击社会单位列表左上方的‘+’号按钮，弹出添加社会单位的对话框； - 在对话框内搜索并选择指定社会单位，点击确定，即可把该社会单位添加到当前用户组下；
   <br/>

1. <span id="Q13">Q: 如何为指定用户组删除指定社会单位（即该社会单位对该用户组不可见）？</span>
   A: ![](./new/deleteSpecificStationForUserGroup.gif) - 在左侧点击指定用户组； - 点击‘社会单位’标签； - 在搜索框内输入指定社会单位名称或地址，点击搜索或按回车键； - 在下方的社会单位列表中， 点击指定社会单位‘操作’一栏中的‘垃圾桶’按钮； - 如该社会单位挂靠在多个子用户组或业主时（即该社会单位对子用户组或业主可见）, 则会弹出‘设置社会单位的可见用户组或用户’的对话框，在此对话框内可设置该社会单位对哪个用户组或者用户不可见；当前用户组为该社会单位所有者的所在用户组时，则不可删除；当在所选用户组下，该社会单位的所属用户组只有一个时，则弹出确定删除的确认框；
   <br/>
